---
kind: other
id: Properties.T:Autodesk.Revit.DB.Macros.DocumentEntryPoint
source: html/261d1ad6-e33f-4d4e-e359-1663c3762abb.htm
---
# DocumentEntryPoint Properties

Retrieve the active project location.